title: Detect Encoded PowerShell in ScriptBlock
id: 100001
status: experimental
description: Detects encoded command usage in PowerShell Operational logs.
logsource:
    product: windows
    service: powershell
detection:
    selection:
        data.win.system.eventID: 4104
        data.win.eventdata.scriptBlockText|contains: 
            - '-EncodedCommand'
            - '-enc'
            - 'dwBoAG8AYQBtAGkA'
    condition: selection
level: high